Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# MenuTip.AutoComposer
source: **Auto Composer** replaces your shell prompt with a macOS-native text field. It does syntax highlighting and command and filename completion. You can also enable AI-powered suggestions. Shell Integration is required.
de: **Auto Composer** ersetzt Ihre Shell-Eingabeaufforderung durch ein natives macOS-Textfeld. Es bietet Syntaxhervorhebung sowie Befehls- und Dateinamenvervollständigung. Sie können außerdem KI-gestützte Vorschläge aktivieren. Shell Integration ist erforderlich.
ja: **オートコンポーザー**は、シェルプロンプトをmacOSネイティブのテキストフィールドに置き換えます。構文のハイライト表示、コマンドとファイル名の補完を行います。AIによる候補表示も有効にできます。Shell Integrationが必要です。
pt_br: O **Auto Compositor** substitui o prompt do seu shell por um campo de texto nativo do macOS. Ele faz realce de sintaxe e completação de comandos e nomes de arquivos. Você também pode ativar sugestões com tecnologia de IA. É necessária a Shell Integration.
ru: **Автокомпозер** заменяет приглашение оболочки нативным для macOS текстовым полем. Он выполняет подсветку синтаксиса, автодополнение команд и имён файлов. Также можно включить подсказки на основе ИИ. Требуется Shell Integration.
zh_hans: **Auto Composer** 用 macOS 原生文本字段替换你的 shell 提示符。它支持语法高亮和命令及文件名补全功能，还可以启用 AI 驱动的建议功能。需要 shell 集成支持。

# MenuTip.BroadcastInput.BroadcastInputtoAllPanesinAllTabs
source: When enabled, anything you type in this window is sent to all sessions in this window.
de: Wenn aktiviert, wird alles, was Sie in diesem Fenster eingeben, an alle Sitzungen in diesem Fenster gesendet.
ja: 有効にすると、このウインドウ内で入力した内容はすべて、このウインドウ内のすべてのセッションに送信されます。
pt_br: Quando ativado, tudo o que você digita nesta janela é enviado a todas as sessões desta janela.
ru: Если включено, всё, что вы вводите в этом окне, отправляется во все сеансы этого окна.
zh_hans: 启用后，在此窗口中输入的任何内容都会发送到该窗口内的所有会话。

# MenuTip.BroadcastInput.BroadcastInputtoAllPanesinCurrentTab
source: When enabled, anything you type in this tab is sent to all sessions in this tab.
de: Wenn aktiviert, wird alles, was Sie in diesem Tab eingeben, an alle Sitzungen in diesem Tab gesendet.
ja: 有効にすると、このタブ内で入力した内容はすべて、このタブ内のすべてのセッションに送信されます。
pt_br: Quando ativado, tudo o que você digita nesta aba é enviado a todas as sessões desta aba.
ru: Если включено, всё, что вы вводите на этой вкладке, отправляется во все сеансы этой вкладки.
zh_hans: 启用后，在此标签页中输入的任何内容都会发送到该标签页内的所有会话。

# MenuTip.BroadcastInput.CurrentSessionisBroadcastSource
source: When enabled, typing in this session is broadcast to other sessions in the same broadcast domain. Typing in other sessions sends input only to those sessions.
de: Wenn aktiviert, wird die Eingabe in dieser Sitzung an andere Sitzungen in derselben Übertragungsdomäne übertragen. Die Eingabe in anderen Sitzungen wird nur an diese Sitzungen gesendet.
ja: 有効にすると、このセッションでの入力は同じブロードキャストドメイン内の他のセッションにブロードキャストされます。他のセッションでの入力は、それらのセッションにのみ送信されます。
pt_br: Quando ativado, o que você digita nesta sessão é transmitido às outras sessões do mesmo domínio de transmissão. O que você digita em outras sessões envia entrada apenas para essas sessões.
ru: Если включено, ввод в этом сеансе транслируется в другие сеансы в том же домене трансляции. Ввод в других сеансах отправляется только в эти сеансы.
zh_hans: 启用后，在此会话中输入的内容会广播到同一广播域内的其他会话。在其它会话中输入的内容则仅发送到那些会话中。

# MenuTip.BroadcastInput.ShowBackgroundPatternIndicator
source: When enabled, prominent red lines are drawn in the background to indicate that text you type is being broadcast to other sessions.
de: Wenn aktiviert, werden auffällige rote Linien im Hintergrund gezeichnet, um anzuzeigen, dass der von Ihnen eingegebene Text an andere Sitzungen übertragen wird.
ja: 有効にすると、入力したテキストが他のセッションにブロードキャストされていることを示すため、背景に目立つ赤い線が描画されます。
pt_br: Quando ativado, linhas vermelhas em destaque são desenhadas no fundo para indicar que o texto que você digita está sendo transmitido a outras sessões.
ru: Если включено, на фоне отображаются заметные красные линии, указывающие на то, что вводимый вами текст транслируется в другие сеансы.
zh_hans: 启用后，背景会显示醒目的红色线条，表示你输入的文本正在被广播到其他会话中。

# MenuTip.BroadcastInput.ToggleBroadcastInputtoCurrentSession
source: Adds or removes this session from the set of sessions in this window that have broadcast enabled. When you type in a session with broadcast enabled, the keystrokes are sent to all other sessions in the same window that have broadcast enabled.
de: Fügt diese Sitzung der Gruppe von Sitzungen in diesem Fenster mit aktivierter Übertragung hinzu oder entfernt sie daraus. Wenn Sie in einer Sitzung mit aktivierter Übertragung tippen, werden die Tastenanschläge an alle anderen Sitzungen im selben Fenster mit aktivierter Übertragung gesendet.
ja: このセッションを、このウインドウ内でブロードキャストが有効なセッションの集合に追加または削除します。ブロードキャストが有効なセッションで入力すると、そのキーストロークは同じウインドウ内でブロードキャストが有効な他のすべてのセッションに送信されます。
pt_br: Adiciona ou remove esta sessão do conjunto de sessões desta janela que têm a transmissão ativada. Quando você digita em uma sessão com a transmissão ativada, as teclas são enviadas a todas as outras sessões da mesma janela que têm a transmissão ativada.
ru: Добавляет или удаляет этот сеанс из набора сеансов в этом окне, для которых включена трансляция. Когда вы вводите текст в сеансе с включённой трансляцией, нажатия клавиш отправляются во все остальные сеансы в этом же окне, для которых включена трансляция.
zh_hans: 添加或移除当前窗口中已启用广播的会话。当输入包含广播功能的会话时，按键操作将同时发送到同一窗口内所有已启用广播的会话中。

# MenuTip.BurySession
source: Buried sessions are hidden in the **Buried Sessions** menu below and do not appear in any window. These are particularly useful for the session where you initiate tmux integration by running `tmux -CC`.
de: Vergrabene Sitzungen werden im Menü **Vergrabene Sitzungen** unten ausgeblendet und erscheinen in keinem Fenster. Sie sind besonders nützlich für die Sitzung, in der Sie die tmux-Integration durch Ausführen von `tmux -CC` starten.
ja: 埋め込まれたセッションは下の**埋め込まれたセッション**メニューに隠され、どのウインドウにも表示されません。これは、`tmux -CC`を実行してtmux連携を開始するセッションで特に便利です。
pt_br: Sessões enterradas ficam ocultas no menu **Sessões enterradas** abaixo e não aparecem em nenhuma janela. São especialmente úteis para a sessão em que você inicia a integração com tmux executando `tmux -CC`.
ru: Скрытые сеансы находятся в меню **Скрытые сеансы** ниже и не отображаются ни в одном окне. Это особенно полезно для сеанса, в котором вы инициируете интеграцию с tmux, запуская `tmux -CC`.
zh_hans: 隐藏会话显示在下方**隐藏会话**菜单中，不会出现在任何窗口中。特别适用于通过运行 `tmux -CC` 启动 tmux 集成的会话。

# MenuTip.Composer
source: The Composer is a window within the terminal where you can edit text using macOS-native controls. It does syntax highlighting, command and filename completion—even over SSH (provided you use SSH Integration). If AI features are enabled, you can also get AI-powered suggestions. You can even have multiple cursors! When you're ready, you can send the whole buffer or just a line at a time to your shell.
de: Der Composer ist ein Fenster innerhalb des Terminals, in dem Sie Text mit nativen macOS-Bedienelementen bearbeiten können. Er bietet Syntaxhervorhebung sowie Befehls- und Dateinamenvervollständigung, sogar über SSH (sofern Sie SSH Integration verwenden). Wenn KI-Funktionen aktiviert sind, erhalten Sie außerdem KI-gestützte Vorschläge. Sie können sogar mehrere Cursor verwenden! Wenn Sie bereit sind, können Sie den gesamten Puffer oder jeweils nur eine Zeile an Ihre Shell senden.
ja: コンポーザーは、macOSネイティブのコントロールを使ってテキストを編集できる、ターミナル内のウインドウです。構文のハイライト表示、コマンドとファイル名の補完を行い、SSH経由（SSH Integrationを使用している場合）でも利用できます。AI機能が有効な場合は、AIによる候補も取得できます。複数カーソルも使用できます。準備ができたら、バッファ全体、または1行ずつシェルに送信できます。
pt_br: O Compositor é uma janela dentro do terminal onde você pode editar texto usando controles nativos do macOS. Ele faz realce de sintaxe e completação de comandos e nomes de arquivos, mesmo por SSH (desde que você use a SSH Integration). Se os recursos de IA estiverem ativados, você também pode obter sugestões com tecnologia de IA. Você pode até ter vários cursores! Quando estiver pronto, você pode enviar o buffer inteiro ou apenas uma linha por vez ao seu shell.
ru: Композер представляет собой окно внутри терминала, где можно редактировать текст с помощью нативных для macOS элементов управления. Он выполняет подсветку синтаксиса и автодополнение команд и имён файлов, в том числе через SSH (при использовании SSH Integration). Если включены функции ИИ, вы также можете получать подсказки на основе ИИ. Можно даже использовать несколько курсоров! Когда будете готовы, вы можете отправить в оболочку весь буфер целиком или только одну строку.
zh_hans: Composer是终端内的一个窗口，可使用 macOS 原生控件编辑文本。它支持语法高亮、命令和文件名补全功能——即使通过 SSH 也能实现（前提是使用 SSH 集成）。如果启用了 AI 功能，还可以获得基于 AI 的推荐建议。甚至可以拥有多个光标！准备就绪后，可以将整个缓冲区或逐行内容发送到 shell 中。

# MenuTip.Edit.Actions
source: Actions are saved instructions for iTerm2. For example, you could create an action that opens a new window and then creates a split pane.
de: Aktionen sind gespeicherte Anweisungen für iTerm2. Sie könnten beispielsweise eine Aktion erstellen, die ein neues Fenster öffnet und dann einen geteilten Bereich erzeugt.
ja: アクションは、iTerm2に対する保存された指示です。たとえば、新しいウインドウを開いてから分割ペインを作成するアクションを作ることができます。
pt_br: Ações são instruções salvas para o iTerm2. Por exemplo, você poderia criar uma ação que abre uma nova janela e depois cria um painel dividido.
ru: Действия представляют собой сохранённые инструкции для iTerm2. Например, можно создать действие, которое открывает новое окно, а затем создаёт разделённую панель.
zh_hans: Action是iTerm2的保存指令。例如，可以创建一个动作来打开新窗口并随后创建分屏窗格。

# MenuTip.Edit.Snippets
source: Snippets are pieces of text that you save to reuse later. They’re great for frequently used commands, hard-to-remember directories, and much more.
de: Snippets sind Textstücke, die Sie speichern, um sie später wiederzuverwenden. Sie eignen sich hervorragend für häufig verwendete Befehle, schwer zu merkende Verzeichnisse und vieles mehr.
ja: スニペットは、後で再利用するために保存するテキストの断片です。よく使うコマンドや覚えにくいディレクトリなど、さまざまな用途に便利です。
pt_br: Fragmentos são pedaços de texto que você salva para reutilizar mais tarde. São ótimos para comandos usados com frequência, diretórios difíceis de lembrar e muito mais.
ru: Сниппеты представляют собой фрагменты текста, которые вы сохраняете для повторного использования. Они отлично подходят для часто используемых команд, труднозапоминаемых каталогов и многого другого.
zh_hans: Snippets是保存的文本片段，可供后续重复使用。非常适合用于常用命令、难以记忆的目录等场景。

# MenuTip.EngageArtificialIntelligence
source: When selected at a shell prompt (provided Shell Integration is installed) or in the Composer, it sends the current command to the configured AI system along with a prompt for it to generate a command. If no input is provided, you’ll be asked to give instructions. The generated command goes into the Composer.
de: Wenn dies an einer Shell-Eingabeaufforderung (sofern Shell Integration installiert ist) oder im Composer ausgewählt wird, sendet es den aktuellen Befehl zusammen mit einer Aufforderung an das konfigurierte KI-System, damit dieses einen Befehl generiert. Wird keine Eingabe bereitgestellt, werden Sie gebeten, Anweisungen zu geben. Der generierte Befehl wird in den Composer eingefügt.
ja: シェルプロンプトで（Shell Integrationがインストールされている場合）、またはコンポーザーで選択すると、現在のコマンドが、コマンドを生成するためのプロンプトとともに設定済みのAIシステムに送信されます。入力がない場合は、指示の入力を求められます。生成されたコマンドはコンポーザーに入力されます。
pt_br: Quando selecionado em um prompt do shell (desde que a Shell Integration esteja instalada) ou no Compositor, envia o comando atual ao sistema de IA configurado junto com uma instrução para que ele gere um comando. Se nenhuma entrada for fornecida, será solicitado que você forneça instruções. O comando gerado vai para o Compositor.
ru: При выборе в строке приглашения оболочки (если установлена Shell Integration) или в Композере текущая команда отправляется в настроенную систему ИИ вместе с запросом на генерацию команды. Если ввод не указан, вам будет предложено дать инструкции. Сгенерированная команда попадает в Композер.
zh_hans: 当在 shell 提示符下选中时（需安装 Shell Integration），或在 Composer 中，它会将当前命令及提示词发送给配置的 AI 系统以生成新命令。若未提供输入，则会要求您给出说明。生成的命令会保存到 Composer 中。

# MenuTip.ExplainOutputwithAI
source: This is meant to be used at the shell prompt after executing a command. It requires Shell Integration. The output of the preceding (or selected) command is sent to AI, which annotates the output and opens a chat window for further discussion.
de: Dies ist für die Verwendung an der Shell-Eingabeaufforderung nach dem Ausführen eines Befehls gedacht. Es erfordert Shell Integration. Die Ausgabe des vorherigen (oder ausgewählten) Befehls wird an die KI gesendet, die die Ausgabe kommentiert und ein Chat-Fenster für weitere Diskussionen öffnet.
ja: これは、コマンドを実行した後にシェルプロンプトで使用することを想定しています。Shell Integrationが必要です。直前の（または選択した）コマンドの出力がAIに送信され、AIが出力に注釈を付け、さらに議論するためのチャットウインドウを開きます。
pt_br: Isto deve ser usado no prompt do shell após executar um comando. Requer a Shell Integration. A saída do comando anterior (ou selecionado) é enviada à IA, que anota a saída e abre uma janela de bate-papo para discussão adicional.
ru: Это предназначено для использования в строке приглашения оболочки после выполнения команды. Требуется Shell Integration. Вывод предыдущей (или выделенной) команды отправляется в ИИ, который аннотирует вывод и открывает окно чата для дальнейшего обсуждения.
zh_hans: 此功能可在执行命令后的 shell 提示符下使用，需安装 Shell Integration。之前执行的（或选中的）命令输出会被发送给 AI，AI会注释该输出并打开聊天窗口用于进一步讨论。

# MenuTip.ExportScript
source: If you want to share Python API scripts, you can export them to an `.its` file. If you have a code signing certificate and private key in your Keychain, you can also sign the `.its` file.
de: Wenn Sie Python-API-Skripte teilen möchten, können Sie sie in eine `.its`-Datei exportieren. Wenn Sie über ein Codesignatur-Zertifikat und einen privaten Schlüssel in Ihrem Schlüsselbund verfügen, können Sie die `.its`-Datei auch signieren.
ja: Python APIスクリプトを共有したい場合は、`.its`ファイルに書き出すことができます。コード署名証明書と秘密鍵をキーチェーンに保存している場合は、`.its`ファイルに署名することもできます。
pt_br: Se você quiser compartilhar scripts da API Python, pode exportá-los para um arquivo `.its`. Se você tiver um certificado de assinatura de código e uma chave privada no seu Keychain, também pode assinar o arquivo `.its`.
ru: Если вы хотите поделиться скриптами Python API, вы можете экспортировать их в файл `.its`. Если в вашей связке ключей есть сертификат для подписи кода и закрытый ключ, вы также можете подписать файл `.its`.
zh_hans: 若您希望分享 Python API 脚本，可将其导出为 `.its` 文件。若您的 Keychain 中包含代码签名证书和私钥，也可对 `.its` 文件进行签名。

# MenuTip.Find.Filter
source: **Filter** allows you to hide any lines that do not match a search query, which can be a substring or regular expression. It updates live as new text arrives.
de: **Filter** ermöglicht es Ihnen, Zeilen auszublenden, die nicht mit einer Suchanfrage übereinstimmen, bei der es sich um eine Teilzeichenfolge oder einen regulären Ausdruck handeln kann. Er aktualisiert sich live, sobald neuer Text eintrifft.
ja: **フィルター**を使うと、検索クエリ（部分文字列または正規表現）に一致しない行を非表示にできます。新しいテキストが到着すると、リアルタイムに更新されます。
pt_br: O **Filtro** permite ocultar quaisquer linhas que não correspondam a uma consulta de busca, que pode ser uma substring ou uma expressão regular. Ele é atualizado ao vivo à medida que novo texto chega.
ru: **Фильтр** позволяет скрывать любые строки, которые не соответствуют поисковому запросу (это может быть подстрока или регулярное выражение). Он обновляется в реальном времени по мере поступления нового текста.
zh_hans: **Filter** 可隐藏不符合搜索条件的行，这些条件可以是子字符串或正则表达式。当新文本到达时，该功能会实时更新。

# MenuTip.FindCursor
source: Highlights the location of the cursor and unhides it if it is currently hidden.
de: Hebt die Position des Cursors hervor und macht ihn sichtbar, falls er derzeit ausgeblendet ist.
ja: カーソルの位置をハイライトし、現在非表示になっている場合は表示します。
pt_br: Destaca a localização do cursor e o mostra caso esteja oculto no momento.
ru: Подсвечивает положение курсора и показывает его, если он в данный момент скрыт.
zh_hans: 高亮显示光标位置，若当前隐藏则将其显示出来。

# MenuTip.FoldSelectedLines
source: **Fold** lets you collapse multiple lines into a single line to hide distracting text. You can always unfold it by clicking the arrow in the margin, selecting the text and using **Edit > Unfold in Selection**, or right-clicking and choosing **Unfold**.
de: **Fold** lässt Sie mehrere Zeilen zu einer einzigen Zeile zusammenfassen, um ablenkenden Text auszublenden. Sie können sie jederzeit wieder aufklappen, indem Sie auf den Pfeil am Rand klicken, den Text auswählen und **Bearbeiten > In Auswahl aufklappen** verwenden, oder mit der rechten Maustaste klicken und **Aufklappen** wählen.
ja: **折りたたみ**を使うと、複数の行を1行に折りたたんで邪魔なテキストを隠せます。余白の矢印をクリックする、テキストを選択して**編集 > 選択範囲を展開**を使う、または右クリックして**展開**を選ぶことで、いつでも展開できます。
pt_br: **Dobrar** permite recolher várias linhas em uma única linha para ocultar texto que distrai. Você sempre pode desdobrá-lo clicando na seta na margem, selecionando o texto e usando **Editar > Desdobrar na seleção**, ou clicando com o botão direito e escolhendo **Desdobrar**.
ru: **Свёртывание** позволяет свернуть несколько строк в одну, чтобы скрыть отвлекающий текст. Вы всегда можете развернуть их, щёлкнув стрелку на полях, выделив текст и выбрав **Правка > Развернуть выделение**, либо щёлкнув правой кнопкой мыши и выбрав **Развернуть**.
zh_hans: **Fold** 功能可将多行内容合并为单行，隐藏干扰性文本。您也可以点击边缘箭头、选中文本后选择 **编辑 > 以选中的方式展开**，或右键点击后选择 **展开** 来重新显示。

# MenuTip.GPURendererAvailability
source: Checks whether the GPU Renderer is currently being used in the active session. This is sometimes useful for debugging.
de: Prüft, ob der GPU-Renderer derzeit in der aktiven Sitzung verwendet wird. Dies ist manchmal beim Debuggen hilfreich.
ja: アクティブなセッションで現在GPUレンダラーが使用されているかどうかを確認します。デバッグに役立つことがあります。
pt_br: Verifica se o renderizador de GPU está sendo usado no momento na sessão ativa. Isto às vezes é útil para depuração.
ru: Проверяет, используется ли в данный момент GPU-рендерер в активном сеансе. Иногда это полезно для отладки.
zh_hans: 用于检查当前活动会话中是否正在使用 GPU Renderer。这在调试时有时很有用。

# MenuTip.ImportScript
source: Use **Import** to install scripts others have shared with you. These scripts have the `.its` extension.
de: Verwenden Sie **Importieren**, um Skripte zu installieren, die andere mit Ihnen geteilt haben. Diese Skripte haben die Dateiendung `.its`.
ja: 他の人から共有されたスクリプトをインストールするには、**読み込む**を使用します。これらのスクリプトには`.its`拡張子が付いています。
pt_br: Use **Importar** para instalar scripts que outras pessoas compartilharam com você. Esses scripts têm a extensão `.its`.
ru: Используйте **Импорт**, чтобы установить скрипты, которыми с вами поделились другие. Эти скрипты имеют расширение `.its`.
zh_hans: 使用 **导入** 功能安装他人分享给您的脚本。这些脚本带有 `.its` 扩展名。

# MenuTip.InstallPythonRuntime
source: iTerm2’s Python Runtime is a large binary package (hundreds of MBs) that enables the Python API by installing a pre-built Python environment that scripts can use.
de: iTerm2s Python-Runtime ist ein großes Binärpaket (mehrere hundert MB), das die Python-API aktiviert, indem es eine vorgefertigte Python-Umgebung installiert, die Skripte verwenden können.
ja: iTerm2のPythonランタイムは、スクリプトが使用できるビルド済みのPython環境をインストールすることでPython APIを有効にする、大きなバイナリパッケージ（数百MB）です。
pt_br: O Python Runtime do iTerm2 é um pacote binário grande (centenas de MBs) que ativa a API Python instalando um ambiente Python pré-compilado que os scripts podem usar.
ru: Python Runtime iTerm2 представляет собой большой бинарный пакет (сотни мегабайт), который включает Python API, устанавливая готовое окружение Python, которое могут использовать скрипты.
zh_hans: iTerm2的Python运行时是一个大体积二进制包（数百MB），通过安装预构建的Python环境让脚本能够使用Python API。

# MenuTip.InstallShellIntegration
source: **Shell Integration** consists of shell scripts that run when you log in. They inform iTerm2 of where your shell prompt is. This enables dozens of useful features such as command history, directory history, AI features, and more.
de: **Shell Integration** besteht aus Shell-Skripten, die beim Anmelden ausgeführt werden. Sie teilen iTerm2 mit, wo sich Ihre Shell-Eingabeaufforderung befindet. Dies ermöglicht Dutzende nützlicher Funktionen wie Befehlsverlauf, Verzeichnisverlauf, KI-Funktionen und mehr.
ja: **Shell Integration**は、ログイン時に実行されるシェルスクリプトで構成されています。これにより、シェルプロンプトの位置をiTerm2に伝えます。これにより、コマンド履歴、ディレクトリ履歴、AI機能など、多数の便利な機能が利用可能になります。
pt_br: A **Shell Integration** consiste em scripts de shell que são executados quando você faz login. Eles informam ao iTerm2 onde está o prompt do seu shell. Isto ativa dezenas de recursos úteis, como histórico de comandos, histórico de diretórios, recursos de IA e muito mais.
ru: **Shell Integration** состоит из скриптов оболочки, которые запускаются при входе в систему. Они сообщают iTerm2, где находится приглашение оболочки. Это открывает доступ к десяткам полезных функций, таких как история команд, история каталогов, функции ИИ и многое другое.
zh_hans: **Shell集成**包含登录时运行的shell脚本。这些脚本会告知iTerm2您的shell提示符所在位置，从而支持数十种实用功能，如命令历史、目录历史、AI功能等。

# MenuTip.LockLayout
source: When a window’s layout is locked, its tabs and panes can’t be added, closed, reordered, dragged, or moved to another window, so a stray click or drag can’t rearrange it. Resizing panes, opening new windows, and closing the window still work. This is an alternative to Lock Size; turning one on turns the other off.
de: Wenn das Layout eines Fensters gesperrt ist, können seine Tabs und Bereiche nicht hinzugefügt, geschlossen, neu angeordnet, gezogen oder in ein anderes Fenster verschoben werden, sodass ein versehentlicher Klick oder Ziehvorgang es nicht durcheinanderbringen kann. Die Größe von Bereichen zu ändern, neue Fenster zu öffnen und das Fenster zu schließen funktioniert weiterhin. Dies ist eine Alternative zu „Größe sperren“; wenn eine Option aktiviert wird, wird die andere deaktiviert.
ja: ウインドウのレイアウトがロックされている場合、そのタブとペインは追加、閉じる、並べ替え、ドラッグ、他のウインドウへの移動ができなくなるため、誤ったクリックやドラッグでレイアウトが崩れることはありません。ペインのサイズ変更、新しいウインドウを開く、ウインドウを閉じる操作は引き続き行えます。これは「サイズをロック」の代替機能であり、一方を有効にすると他方は無効になります。
pt_br: Quando o layout de uma janela está bloqueado, suas abas e painéis não podem ser adicionados, fechados, reordenados, arrastados ou movidos para outra janela, de modo que um clique ou arrasto acidental não pode rearranjá-la. Redimensionar painéis, abrir novas janelas e fechar a janela ainda funcionam. Esta é uma alternativa a Bloquear tamanho; ativar uma desativa a outra.
ru: Когда раскладка окна заблокирована, её вкладки и панели нельзя добавлять, закрывать, менять местами, перетаскивать или перемещать в другое окно, поэтому случайный щелчок или перетаскивание не могут её изменить. Изменение размера панелей, открытие новых окон и закрытие окна по-прежнему работают. Это альтернатива функции «Заблокировать размер»: включение одной функции отключает другую.
zh_hans: 当窗口的布局被锁定后，其标签页和窗格无法添加、关闭、重新排序、拖动或移动到其他窗口中，因此随意点击或拖拽也无法改变其排列。调整窗格大小、打开新窗口以及关闭窗口仍然有效。这是“锁定尺寸”的替代方案；开启其中一个会同时关闭另一个。

# MenuTip.LockSize
source: Locked windows resist being resized. This can be useful when macOS screws up your windows when connecting or disconnecting displays.
de: Gesperrte Fenster widersetzen sich einer Größenänderung. Das kann nützlich sein, wenn macOS beim Verbinden oder Trennen von Displays Ihre Fenster durcheinanderbringt.
ja: ロックされたウインドウはサイズ変更されにくくなります。これは、ディスプレイの接続や切断時にmacOSがウインドウを崩してしまう場合に便利です。
pt_br: Janelas bloqueadas resistem a serem redimensionadas. Isto pode ser útil quando o macOS bagunça suas janelas ao conectar ou desconectar telas.
ru: Заблокированные окна сопротивляются изменению размера. Это может быть полезно, когда macOS портит расположение ваших окон при подключении или отключении дисплеев.
zh_hans: 被锁定的窗口无法调整大小。在连接或断开显示器时，macOS 导致窗口异常时，此功能非常有用。
